Ansersion/Beecom/src/CORTEX_STM32F103_Keil/bc_src/wifi/src/wifi_common.c
//   Copyright 2017 Ansersion
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//

// STD headers
#include <string.h>

// FreeRTOS headers
#include <FreeRTOS.h>
#include <task.h>

// STM32 headers
#include <stm32f10x_usart.h>

// Beecom headers
#include <wifi_common.h>
#include <wifi_irq.h>
#include <terminal.h>
#include <mutex.h>
#include <wifi_clbk.h>
#include <bc_queue.h>
#include <bc_msg.h>

extern TaskHandle_t DataHubHandle;

WIFI_MODE wifi_mode = WIFI_MODE_INVALID;
WIFI_MODE wifi_server = WIFI_SERVER_INVALID; 

uint8_t wifi_ssid_test[] = "\"hb402-2g\"";
uint8_t wifi_pwd_test[] = "\"68704824\"";


BC_SocketData sock_data[BC_MAX_SOCKET_NUM];
// QueueHandle_t sock_queue[BC_MAX_SOCKET_NUM];
BC_SocketData sock_serv;
uint8_t INADDR_ANY[16];
/**************************
  It's really a dull way to
  define the buffer.
  All of "BC_MAX_SOCKET_NUM"
***************************/
uint8_t sock_buf_0[BC_MAX_SOCKET_BUF_SIZE];
uint8_t sock_buf_1[BC_MAX_SOCKET_BUF_SIZE];
uint8_t sock_buf_2[BC_MAX_SOCKET_BUF_SIZE];
uint8_t sock_buf_3[BC_MAX_SOCKET_BUF_SIZE];
uint8_t sock_buf_4[BC_MAX_SOCKET_BUF_SIZE];

uint8_t sock_buf_serv[BC_MAX_SOCKET_BUF_SIZE];

static sint8_t pu8CmdMsg[128];
// static sint8_t pu8CmdMsgClose[64];
// static sint8_t pu8CmdMsgOpen[128];
// static sint8_t pu8CmdMsgConnect[128];

static const sint8_t * WifiCmdReset = "AT+RST\r\n";
static const sint8_t * WifiCmdSetMode = "AT+CWMODE=%d\r\n";
static const sint8_t * WifiCmdSetNet = "AT+CWJAP=\"%s\",\"%s\"\r\n";
static const sint8_t * WifiCmdSetMux = "AT+CIPMUX=%d\r\n";
static const sint8_t * WifiCmdSetServ = "AT+CIPSERVER=%d,%d\r\n";
static const sint8_t * WifiCmdStatus = "AT+CIPSTATUS\r\n";
static const sint8_t * WifiCmdCloseSock = "AT+CIPCLOSE=%d\r\n";
static const sint8_t * WifiCmdSend = "AT+CIPSEND=%d,%d\r\n";

static const sint8_t * WifiCmdCifSr = "AT+CIFSR\r\n";
static const sint8_t * WifiCmdCifSt = "AT+CIPSTATUS\r\n";

WIFI_MODE GetWifiModeInfo(void)
{
	return wifi_mode;
}

WIFI_SERVER GetWifiServerInfo(void)
{
	return wifi_server;
}

sint32_t BC_WifiReset(uint32_t * timeout)
{
	sint32_t ret = BC_OK;
	uint32_t fail_count = 0;

	while(1) {
		if(BCMutexLock(&WifiRecvFlagMutex) == BC_OK) {
			WifiRecvFlag = 0;
			BCMutexUnlock(&WifiRecvFlagMutex);
			break;
		}
	}

	while(1) {
		// check max failed count
		if(++fail_count > WIFI_RESET_MAX_FAIL_COUNT) {
			ret = -10;
			break;
		}
		// send command
		strcpy(pu8CmdMsg, WifiCmdReset);
		uputs(USART_WIFI, pu8CmdMsg);
		// delay a little time(at least) 
		vTaskDelay(10 / portTICK_RATE_MS); // at least delay 10ms
		// delay 'timeout' microseconds if any
		if(timeout) {
			vTaskDelay(*timeout / portTICK_RATE_MS);
		}
		if(BCMutexLock(&WifiRecvFlagMutex) == BC_OK) {
			// check if setting OK
			if(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK) {
				WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
				BCMutexUnlock(&WifiRecvFlagMutex);
				ret = BC_OK;
				break;
			// check if setting error
			} else if(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_ERR) {
				WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_ERR;
				BCMutexUnlock(&WifiRecvFlagMutex);
				ret = -4;
				break;
			}
			BCMutexUnlock(&WifiRecvFlagMutex);
		}
		// after 'timeout' microseconds there is no
		// result, so return error
		if(timeout) {
			ret = -1;
			break;
		}
		
	}

	return ret;
}

sint32_t BC_WifiSetMode(WIFI_MODE mode, uint32_t * timeout)
{
	sint32_t ret = BC_OK;
	uint32_t fail_count = 0;
	if(WIFI_MODE_INVALID == mode) {
		return -11;
	}

	while(1) {
		// check max failed count
		if(++fail_count > WIFI_SET_MODE_MAX_FAIL_COUNT) {
			ret = -10;
			break;
		}
		// send command
		sprintf(pu8CmdMsg, WifiCmdSetMode, mode);
		uputs(USART_WIFI, pu8CmdMsg);
		// delay a little time(at least) 
		vTaskDelay(10 / portTICK_RATE_MS); // at least delay 10ms
		// delay 'timeout' microseconds if any
		if(timeout) {
			vTaskDelay(*timeout / portTICK_RATE_MS);
		}
		if(BCMutexLock(&WifiRecvFlagMutex) == BC_OK) {
			// check if setting OK
			if(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK) {
				WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
				BCMutexUnlock(&WifiRecvFlagMutex);
				wifi_mode = mode;
				ret = BC_OK;
				break;
			// check if setting error
			} else if(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_ERR) {
				WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_ERR;
				BCMutexUnlock(&WifiRecvFlagMutex);
				ret = -4;
				break;
			}
			BCMutexUnlock(&WifiRecvFlagMutex);
		}
		// after 'timeout' microseconds there is no
		// result, so return error
		if(timeout) {
			ret = -1;
			break;
		}
		
	}

	return ret;
}

sint32_t BC_WifiSetNet(uint8_t * ssid, uint8_t * pwd, uint32_t * timeout)
{
	sint32_t ret = BC_OK;
	uint32_t fail_count = 0;

	while(1) {
		// check max failed count
		if(++fail_count > WIFI_SET_NET) {
			ret = -10;
			break;
		}
		// send command
		sprintf(pu8CmdMsg, WifiCmdSetNet, ssid, pwd);
		uputs(USART_WIFI, pu8CmdMsg);
		// delay a little time(at least) 
		vTaskDelay(10 / portTICK_RATE_MS); // at least delay 10ms
		// delay 'timeout' microseconds if any
		if(timeout) {
			vTaskDelay(*timeout / portTICK_RATE_MS);
		}
		if(BCMutexLock(&WifiRecvFlagMutex) == BC_OK) {
			// check if setting OK
			if(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK) {
				WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
				BCMutexUnlock(&WifiRecvFlagMutex);
				ret = BC_OK;
				break;
			// check if setting error
			} else if(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_ERR) {
				WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_ERR;
				BCMutexUnlock(&WifiRecvFlagMutex);
				ret = -4;
				break;
			}
			BCMutexUnlock(&WifiRecvFlagMutex);
		}
		// after 'timeout' microseconds there is no
		// result, so return error
		if(timeout) {
			ret = -1;
			break;
		}
		
