Ansersion/Beecom/src/CORTEX_STM32F103_Keil/bc_src/wifi/src/wifi_common.c
	}

	return ret;
}

sint32_t BC_WifiGetStatus(uint32_t * timeout)
{
	sint32_t ret = BC_OK;
	uint32_t fail_count = 0;

	while(1) {
		// check max failed count
		if(++fail_count > WIFI_GET_STATUS_MAX_FAIL_COUNT) {
			ret = -10;
			break;
		}
		// send command
		strcpy(pu8CmdMsg, WifiCmdStatus);
		uputs(USART_WIFI, pu8CmdMsg);
		// delay a little time(at least) 
		vTaskDelay(10 / portTICK_RATE_MS); // at least delay 10ms
		// delay 'timeout' microseconds if any
		if(timeout) {
			vTaskDelay(*timeout / portTICK_RATE_MS);
		}
		if(BCMutexLock(&WifiRecvFlagMutex) == BC_OK) {
			// check if setting OK
			if(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK) {
				WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
				BCMutexUnlock(&WifiRecvFlagMutex);
				ret = BC_OK;
				break;
			// check if setting error
			} else if(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_ERR) {
				WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_ERR;
				BCMutexUnlock(&WifiRecvFlagMutex);
				ret = -4;
				break;
			}
			BCMutexUnlock(&WifiRecvFlagMutex);
		}
		// after 'timeout' microseconds there is no
		// result, so return error
		if(timeout) {
			ret = -1;
			break;
		}
		
	}

	return ret;
}

sint32_t BC_Socket(sint32_t family, sint32_t type, sint32_t protocol)
{
	int i;
	// sock_data[0]: for server
	// sock_data[BC_MAX_SOCKET_NUM-1]: for client to connect internet
	for(i = 0; i < BC_MAX_SOCKET_NUM - 1; i++) {
		if(BC_TRUE != sock_data[i].valid) {
			sock_data[i].valid = BC_TRUE;
			return i;
		}
	}
	return -1;
}

sint32_t BC_Bind(sint32_t sockfd, const BC_Sockaddr * myaddr, uint32_t addrlen)
{
	/// if(!ASSERT_SOCK_VALID(sockfd)) {
	/// 	return -1;
	/// }
	if(!myaddr) {
		return -2;
	}
	// if(BC_TRUE != sock_data[sockfd].valid) {
	// 	return -3;
	// }
	// memcpy(&(sock_data[sockfd].addr), myaddr, addrlen);
	return BC_OK;;
}

sint32_t BC_Listen(sint32_t sockfd, sint32_t backlog)
{
	// uint32_t delay_ms = 50;
	// uint32_t fail_count = 0;
	// if(!ASSERT_SOCK_VALID(sockfd)) {
	// 	return -1;
	// }
	if(backlog < 0) {
		return -2;
	}
	/// if(BC_TRUE != sock_data[sockfd].valid) {
	/// 	return -3;
	/// }
	/// sock_data[sockfd].backlog = backlog;

	return BC_OK;
}

sint32_t BC_Accept(sint32_t sockfd, BC_Sockaddr * cliaddr, uint32_t * addrlen)
{
	BC_SocketData sock_data_tmp;
	uint32_t fail_count = 0;
	uint32_t wifi_id = 0;
	BC_QueueElement qe;
	stWifiMsgUnit WifiMsgUnit;

	// if(!ASSERT_SOCK_VALID(sockfd)) {
	// 	return -1;
	// }
	if(!cliaddr) {
		return -2;
	}
	if(!addrlen) {
		return -3;
	}
	// if(BC_TRUE != sock_data[sockfd].valid) {
	// 	return -4;
	// }
	// wait for the semphore

	// k_cliaddr = cliaddr;
	// k_addrlen = addrlen;

	while(1) {
		if(pdFALSE == xQueueReceive(sock_serv.queue_handle, &sock_data_tmp, 5000/portTICK_RATE_MS)) {
			printf("addr1: %s\r\n", INADDR_ANY);
			continue;
		}
		if(!(sock_data[sock_data_tmp.wifi_id].wifi_recv_flag & WIFI_MSG_FLAG_GOT_CONNECT)) {
			printf("!WIFI_MSG_FLAG_GOT_CONNECT\r\n");
			continue;
		}

		printf("wifi_id: %d\t%x\t%d\r\n", sock_data_tmp.wifi_id, sock_data[sock_data_tmp.wifi_id].wifi_recv_flag, sock_data_tmp.valid);

		BC_MsgInit(&qe, BC_MOD_DEFAULT, BC_MOD_WIFI);
		WifiMsgUnit.WifiClbkCmd = WIFI_CLBK_CMD_QRY_ST;
		BC_MsgSetMsg(&qe, (uint8_t *)&WifiMsgUnit, sizeof(WifiMsgUnit));
		while(1) {
			while(BC_Enqueue(BC_ModInQueue[BC_MOD_DEFAULT], &qe, TIMEOUT_COMMON) == BC_FALSE) {
			}
			vTaskResume(DataHubHandle);

			if(pdFALSE == xQueueReceive(sock_data[sock_data_tmp.wifi_id].queue_handle, &sock_data_tmp, 5000/portTICK_RATE_MS)) {
				fail_count++;
				if(fail_count > 3) {
					sock_data_tmp.wifi_id = BC_MAX_SOCKET_NUM+1;
					break;
				}
				printf("try again(addr2: %s)\r\n", INADDR_ANY);
			} else {
				break;
			}
		}
		printf("backlog-s: %d\r\n", sock_serv.backlog);
		printf("backlog-t: %d\r\n", sock_data_tmp.backlog);
		printf("recv-t: %d\r\n", sock_data_tmp.wifi_recv_flag);
		printf("client-ip: %s\r\n", sock_data_tmp.addr.sin_addr.s_addr);
		printf("client-port: %d\r\n", sock_data_tmp.addr.sin_port);
		if(BC_OK != CheckServAddr(INADDR_ANY)) {
			// BC_WifiSetServ(WIFI_SERVER_OPEN, BC_CENTER_SERV_PORT, NULL);
			// BC_WifiSetNet(wifi_ssid_test, wifi_pwd_test, NULL);
		} else {
			printf("CheckServAddr OK\r\n");
			break;
		}
	}
	printf("wifi_id:%d\r\n", sock_data_tmp.wifi_id);
	if(!ASSERT_SOCK_VALID(sock_data_tmp.wifi_id)) {
		return -4;
	}
	wifi_id = sock_data_tmp.wifi_id;
	sock_data[wifi_id].valid = BC_TRUE;
	memcpy(cliaddr, &(sock_data_tmp.addr), sizeof(BC_Sockaddr));
	memcpy(&(sock_data[wifi_id].addr), &(sock_data_tmp.addr), sizeof(BC_Sockaddr));

	return wifi_id;
}

sint32_t BC_Connect(sint32_t sockfd, const BC_Sockaddr * servaddr, uint32_t addrlen)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!servaddr) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}

	sprintf(pu8CmdMsg, "AT+CIPSTART=%d,\"TCP\",\"%s\",%d", sockfd, servaddr->sin_addr.s_addr, servaddr->sin_port);
	return 0;
}

sint32_t BC_Close(sint32_t sockfd)
{
	// sint32_t ret = BC_OK;
	uint32_t fail_count = 0;
	BC_QueueElement qe;
	stWifiMsgUnit WifiMsgUnit;
	BC_SocketData sock_data_tmp;

	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!sock_data[sockfd].valid) {
		return -2;
	}
	BC_MsgInit(&qe, BC_MOD_DEFAULT, BC_MOD_WIFI);
	WifiMsgUnit.WifiClbkCmd = WIFI_CLBK_CMD_CLOSE_SOCK;
	WifiMsgUnit.ClbkPara.ClsSockPara.sockfd = sockfd;
	BC_MsgSetMsg(&qe, (uint8_t *)&WifiMsgUnit, sizeof(WifiMsgUnit));
	while(1) {
		while(BC_Enqueue(BC_ModInQueue[BC_MOD_DEFAULT], &qe, TIMEOUT_COMMON) == BC_FALSE) {
		}
		vTaskResume(DataHubHandle);

		if(pdFALSE == xQueueReceive(sock_data[sockfd].queue_handle, &sock_data_tmp, 1000/portTICK_RATE_MS)) {
			fail_count++;
			if(fail_count > 3) {
				// sock_data_tmp.wifi_id = BC_MAX_SOCKET_NUM+1;
				// break;
				sock_data[sockfd].valid = BC_FALSE;
				return BC_ERR;
			}
		} else {
			break;
		}
	}
	// sprintf(pu8CmdMsg, "AT+CIPCLOSE=%d\r\n", sockfd);
	// uputs(USART_WIFI, pu8CmdMsg);
	sock_data[sockfd].valid = BC_FALSE;
	return BC_OK;
}

sint32_t BC_Recv(sint32_t sockfd, void * buff, uint32_t nbytes, sint32_t flags)
{
	BC_SocketData sock_data_tmp;
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!buff) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}
	sock_data_tmp.wifi_id = -1;
	while(BC_FALSE == xQueueReceive(sock_data[sockfd].queue_handle, &sock_data_tmp, 1000/portTICK_RATE_MS)) {
		// TODO:
		printf("BC_Recv: xQueueReceive == pdFALSE:%d\r\n", sockfd);
		printf("BC_Recv: wifi_id:%d\r\n", sock_serv.wifi_id);
		printf("BC_Recv: ipd_size:%d\r\n", sock_serv.ipd_size);
		// Judge if remote close
	}
	printf("BC_Recv: xQueueReceive == pdTRUE\r\n");
	printf("BC_Recv: wifi_id(serv):%d\r\n", sock_serv.wifi_id);
	printf("BC_Recv: ipd_size(serv):%d\r\n", sock_serv.ipd_size);
	printf("BC_Recv: wifi_id:%d\r\n", sock_data_tmp.wifi_id);
	printf("BC_Recv: ipd_size:%d\r\n", sock_data_tmp.ipd_size);
	sock_data[sock_data_tmp.wifi_id].buf[sock_data_tmp.ipd_size] = '\0';
	printf("BC_Recv: str:%s\r\n", sock_data[sock_data_tmp.wifi_id].buf);
	sock_serv.buf[sock_serv.ipd_size] = '\0';
	printf("BC_Recv: str(serv):%s\r\n", sock_serv.buf);
	// if(sock_data[sockfd].wifi_recv_flag | WIFI_MSG_FLAG_GOT_CONNECT | WIFI_MSG_FLAG_GOT_CLOSED) {
	// if(sock_data[sockfd].wifi_recv_flag | WIFI_MSG_FLAG_GOT_CLOSED) {
	// 	return -4;
	// }
	if(!sock_data[sockfd].valid) {
		return -5;
	}
	if(sock_data_tmp.ipd_size > nbytes) {
		return -6;
	}
	memcpy(buff, sock_data[sock_data_tmp.wifi_id].buf, sock_data_tmp.ipd_size+1);
	// vTaskDelay(1000);
	// printf("recv: got IPD");
	// vTaskDelay(1000);
	// printf("recv: wifi_id=%d\r\n", sock_data_tmp.wifi_id);
	// vTaskDelay(1000);
	// printf("recv: %s\r\n", sock_data_tmp.buf);
	// while(1) {
	// 	vTaskDelay(1000);
	// }
	// wait semphore
	// StartReceiveFlag = 1;
	// SET_START_RECV_FLAG(1);
	// while(StartReceiveFlag)
	// 	;
	// read USART_WIFI(in ISA)
	// taskYIELD
	return sock_data_tmp.ipd_size;
}

