Ansersion/Beecom/src/CORTEX_STM32F103_Keil/bc_src/wifi/src/wifi_common.c
sint32_t BC_Send(sint32_t sockfd, void * buff, uint32_t nbytes, sint32_t flags)
{
	static sint32_t i = 0;
	static uint8_t * buf_tmp = NULL;
	BC_QueueElement qe;
	stWifiMsgUnit WifiMsgUnit;
	BC_SocketData sock_data_tmp;
	uint32_t fail_count = 0;

	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!buff) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}

	BC_MsgInit(&qe, BC_MOD_DEFAULT, BC_MOD_WIFI);
	WifiMsgUnit.WifiClbkCmd = WIFI_CLBK_CMD_SEND;
	WifiMsgUnit.ClbkPara.SendPara.sockfd = sockfd;
	WifiMsgUnit.ClbkPara.SendPara.msg = buff;
	WifiMsgUnit.ClbkPara.SendPara.size = nbytes;
	BC_MsgSetMsg(&qe, (uint8_t *)&WifiMsgUnit, sizeof(WifiMsgUnit));
	while(1) {
		while(BC_Enqueue(BC_ModInQueue[BC_MOD_DEFAULT], &qe, TIMEOUT_COMMON) == BC_FALSE) {
		}
		vTaskResume(DataHubHandle);

		if(pdFALSE == xQueueReceive(sock_data[sockfd].queue_handle, &sock_data_tmp, 1000/portTICK_RATE_MS)) {
			fail_count++;
			if(fail_count > 3) {
				// sock_data_tmp.wifi_id = BC_MAX_SOCKET_NUM+1;
				// break;
				sock_data[sockfd].valid = BC_FALSE;
				return -1;
			}
		} else {
			// TODO: Check Send OK
			break;
		}
	}

	// memset(pu8CmdMsg, 0, sizeof(pu8CmdMsg));

	// WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
	// sprintf(pu8CmdMsg, "AT+CIPSEND=%d,%d\r\n", sockfd, nbytes);
	// uputs(USART_WIFI, pu8CmdMsg);
	// vTaskDelay(1000); // TODO
	// WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
	// buf_tmp = (uint8_t *)buff;
	// for(i = 0; i < nbytes; i++) {
	// 	USART_SendData(USART_WIFI, buf_tmp[i]);
	// 	while(USART_GetFlagStatus(USART_WIFI,USART_FLAG_TC)!=SET);
	// }

	return nbytes;
}

sint32_t SocketInit(void)
{
	uint32_t i;

	for(i = 0; i < BC_MAX_SOCKET_NUM; i++) {
		memset(&sock_data[i], 0, sizeof(BC_SocketData));
		sock_data[i].queue_handle = xQueueCreate(SOCK_DATA_QUE_NUM, sizeof(BC_SocketData));
		if(NULL == sock_data[i].queue_handle) {
			return BC_ERR;
		}
	}
	// BC_MAX_SOCKET_NUM == 5;
	sock_data[0].buf = sock_buf_0;
	sock_data[1].buf = sock_buf_1;
	sock_data[2].buf = sock_buf_2;
	sock_data[3].buf = sock_buf_3;
	sock_data[4].buf = sock_buf_4;

	// set sock_data[0] to be the server socket
	memset(&sock_serv, 0, sizeof(BC_SocketData));
	sock_serv.queue_handle = xQueueCreate(BC_MAX_SOCKET_NUM, sizeof(BC_SocketData));
	if(NULL == sock_serv.queue_handle) {
		return BC_ERR;
	}
	sock_serv.buf = sock_buf_serv;

	return BC_OK;
}

// sint32_t SockQueueInit(void)
// {
// 	sint32_t result = BC_OK;
// 	uint32_t i = 0;
// 
// 	for(i = 0; i < BC_MAX_SOCKET_NUM; i++) {
// 		sock_queue[i] = xQueueCreate(1, sizeof(BC_SocketData));
// 		if(NULL == sock_queue[i]) {
// 			return BC_ERR;
// 		}
// 		sock_queue[i].queue_handle = sock_queue[i];
// 	}
// 
// 	return result;
// }

sint32_t CheckServAddr(uint8_t * addr)
{
	if(!addr) {
		return -1;
	}
	// assume min addr len: 1.1.1.1
	// strlen("1.1.1.1") == 7
	if(GetWifiServerInfo() != WIFI_SERVER_OPEN) {
		return -3;
	}
	if(strlen(addr) < 7) {
		return -2;
	}
	return BC_OK;
}


